var Request = new Object();
$(function(){
	var height = 0;
// 	if(navigator.userAgent.indexOf("MSIE")>0){
// 		height = $(window).height() -2;
// 	}else{
	height = $(window).height();	
// 	}
	var width = $(window).width()-20;
	$('#report').attr('style','width:'+width+"px;height:"+height+'px');
	getUrlParams();
});
function OnReady(id){
	var url = path + "design/reporttemplate";
	var data = {id:Request['id'],dc_id:Request['dc_id']};
	$.post(url,data,function(data){
		if(data == 'false'){
			$.MessageBox_alert('提示','报表解析失败','error');
		}else{
			AF.func("Build", data);
			AF.func("CallFunc", "301\r\n3");
		}
	});
}
function OnEvent(id, Event, p1, p2, p3, p4) {
	if (Event == "Saved") {
		saveReport();
	}else if(Event == "Calced"){
//		var cc = [{"退押金金额":"0","客户部门":"袁华伟四级部门","客户姓名":"劳斯莱斯","开户成本":"0","补卡成本":"0","工号":"1111111111111111","押金金额":"0"},{"退押金金额":"0","客户部门":"秦山核电有限公司","客户姓名":"肖山","开户成本":"0","补卡成本":"0","工号":"111aa2","押金金额":"0"},{"退押金金额":"0","客户部门":"校园一卡通","客户姓名":"袁华伟113","开户成本":"0","补卡成本":"0","工号":"113","押金金额":"0"},{"退押金金额":"0","客户部门":"校园一卡通","客户姓名":"袁华伟116","开户成本":"0","补卡成本":"0","工号":"116","押金金额":"0"},{"退押金金额":"0","客户部门":"秦山核电有限公司","客户姓名":"11","开户成本":"0","补卡成本":"0","工号":"11x","押金金额":"0"},{"退押金金额":"0","客户部门":"one","客户姓名":"1344dd","开户成本":"0","补卡成本":"0","工号":"1344dd","押金金额":"0"},{"退押金金额":"0","客户部门":"一级部门","客户姓名":"张超研","开户成本":"20","补卡成本":"0","工号":"20130625","押金金额":"0"},{"退押金金额":"0","客户部门":"一级部门","客户姓名":"张超研","开户成本":"0","补卡成本":"0","工号":"20130625","押金金额":"0"},{"退押金金额":"0","客户部门":"六级部门","客户姓名":"张帅","开户成本":"0","补卡成本":"0","工号":"20130630","押金金额":"0"},{"退押金金额":"0","客户部门":"六级部门","客户姓名":"张帅","开户成本":"20","补卡成本":"0","工号":"20130630","押金金额":"0"},{"退押金金额":"0","客户部门":"二级部门1","客户姓名":"王五","开户成本":"20","补卡成本":"0","工号":"2013065312","押金金额":"0"},{"退押金金额":"0","客户部门":"二级部门1","客户姓名":"王五","开户成本":"0","补卡成本":"0","工号":"2013065312","押金金额":"0"},{"退押金金额":"0","客户部门":"袁华伟一级部门","客户姓名":"11","开户成本":"0","补卡成本":"0","工号":"20130702S1","押金金额":"0"},{"退押金金额":"0","客户部门":"袁华伟一级部门","客户姓名":"11","开户成本":"0","补卡成本":"0","工号":"20130702S1","押金金额":"0"},{"退押金金额":"0","客户部门":"袁华伟一级部门","客户姓名":"11","开户成本":"0","补卡成本":"0","工号":"20130702S1","押金金额":"0"},{"退押金金额":"0","客户部门":"一级部门","客户姓名":"张长远","开户成本":"0","补卡成本":"0","工号":"20130719","押金金额":"0"},{"退押金金额":"0","客户部门":"秦山核电有限公司","客户姓名":"ddd","开户成本":"0","补卡成本":"0","工号":"dddsa2","押金金额":"0"}];
//		var value = JSON.stringify(cc);
//		AF.func("SetSource", "ds1\r\n"+value);
//		AF.func("Calc","");
	}
};
function saveReport(){
	var template = AF.func("GetFileXML", "false");
	var url = path + "design/updatetemplate";
	var data = {content:template,id:Request['id']};
	$.post(url,data,function(data){
		if(data == false){
			$.MessageBox_alert('提示','保存报表失败报表解析失败','error');
		}
	});
}
function getUrlParams(){
	var url=location.search;
	if(url.indexOf("?")!=-1){
		var str = url.substr(1);//去掉?号
		strs= str.split("&");
		for(var i=0;i<strs.length;i++){
			Request[strs[i].split("=")[0]]=unescape(strs[ i].split("=")[1]);
		}
	}
}